# EditProperties

## Description
Displays the 'Properties' dialog for all objects matching the specified search criteria

```pascal
PROCEDURE EditProperties(c : CRITERIA);
```

```python

def vs.EditProperties(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Remarks
Displays the Properties dialog for all objects matching the specified search criteria

## Version
Availability: from VectorWorks12.5
## Category
* Criteria